nicolas-codemate/esp32-pixelcast/src/main.cpp
    uint16_t white = dma_display->color565(255, 255, 255);
    uint16_t dimGray = dma_display->color565(40, 40, 40);
    uint16_t cyan = dma_display->color565(0, 180, 255);
    uint16_t paleBlue = dma_display->color565(100, 160, 255);
    uint16_t gray = dma_display->color565(140, 140, 140);
    uint16_t amber = dma_display->color565(255, 180, 50);
    uint16_t coldBlue = dma_display->color565(80, 140, 255);
    uint16_t orange = dma_display->color565(255, 130, 0);
    uint16_t black = dma_display->color565(0, 0, 0);

    // ============================================================
    // Layout map (64x64 display)
    // NULL font: setCursor = top-left of glyph, char is 7px tall
    // TomThumb: setCursor = baseline, uppercase chars 5px above baseline
    // ============================================================
    // y=1-8:    current weather (icon 8x8 + temp + humidity)
    // y=11:     separator
    // y=16-22:  HH:MM (NULL font top=16) + :SS (TomThumb baseline=23)
    // y=27-33:  date (NULL font top=27)
    // y=36:     separator
    // y=44:     day names (TomThumb baseline=44, glyphs y=39-43)
    // y=47-54:  forecast icons (8x8)
    // y=62:     temps (TomThumb baseline=62, glyphs y=57-61)
    // ============================================================

    if (needsFullRedraw) {
        // Clear and redraw each section individually to avoid full-screen flicker
        // (DOUBLE_BUFFER is off on Trinity, so the DMA scans the buffer live)

        // ---- Current weather (y=0-10) ----
        dma_display->fillRect(0, 0, DISPLAY_WIDTH, 11, black);
        int16_t weatherTextX = 2;
        const uint16_t* builtinCurrentIcon = getBuiltinWeatherIcon(weatherData.currentIcon);
        if (builtinCurrentIcon) {
            drawProgmemIcon(dma_display, builtinCurrentIcon, 1, 1, 1);
            weatherTextX = 11;
        } else {
            CachedIcon* currentIcon = getIcon(weatherData.currentIcon);
            if (currentIcon && currentIcon->valid) {
                drawIconAtScale(currentIcon, 1, 1, 1);
                weatherTextX = 11;
            }
        }

        // Temperature (NULL font, top at y=2 to align with icon)
        dma_display->setFont(NULL);
        dma_display->setTextSize(1);
        dma_display->setTextColor(white);

        char tempStr[8];
        snprintf(tempStr, sizeof(tempStr), "%d", weatherData.currentTemp);
        dma_display->setCursor(weatherTextX, 2);
        dma_display->print(tempStr);

        // Degree symbol (small circle, superscript position)
        int16_t degreeX = weatherTextX + strlen(tempStr) * 6;
        dma_display->drawPixel(degreeX + 1, 1, white);
        dma_display->drawPixel(degreeX,     2, white);
        dma_display->drawPixel(degreeX + 2, 2, white);
        dma_display->drawPixel(degreeX + 1, 3, white);

        // "C" after degree (NULL font, same top as temp)
        int16_t cX = degreeX + 4;
        dma_display->setCursor(cX, 2);
        dma_display->print("C");

        // Drop icon + humidity on right side
        int16_t humidityX = DISPLAY_WIDTH - 18;
        drawDropIcon(humidityX, 2, cyan);

        // Humidity (TomThumb, baseline=8 to align bottom with temp bottom y=8)
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(cyan);
        char humStr[6];
        snprintf(humStr, sizeof(humStr), "%d%%", weatherData.currentHumidity);
        dma_display->setCursor(humidityX + 5, 8);
        dma_display->print(humStr);

        // ---- Separator (y=11) ----
        dma_display->fillRect(0, 11, DISPLAY_WIDTH, 1, black);
        drawSeparatorLine(11, dimGray);

        // ---- Date (y=25-37) ----
        dma_display->fillRect(0, 25, DISPLAY_WIDTH, 13, black);
        unsigned long epochTime = timeClient.getEpochTime();
        struct tm* timeinfo = gmtime((time_t*)&epochTime);

        static const char* dayNamesFr[] = {"DIM", "LUN", "MAR", "MER", "JEU", "VEN", "SAM"};
        static const char* monthNamesFr[] = {"JAN", "FEV", "MAR", "AVR", "MAI", "JUN",
                                             "JUL", "AOU", "SEP", "OCT", "NOV", "DEC"};

        char dateStr[16];
        snprintf(dateStr, sizeof(dateStr), "%s %02d %s",
                 dayNamesFr[timeinfo->tm_wday],
                 timeinfo->tm_mday,
                 monthNamesFr[timeinfo->tm_mon]);

        dma_display->setFont(NULL);
        dma_display->setTextSize(1);
        dma_display->setTextColor(gray);

        int16_t dateWidth = strlen(dateStr) * 6;
        int16_t dateX = (DISPLAY_WIDTH - dateWidth) / 2;
        dma_display->setCursor(dateX, 27);
        dma_display->print(dateStr);

        // ---- Separator (y=36) ----
        drawSeparatorLine(36, dimGray);

        // ---- Forecast (y=38-63) ----
        dma_display->fillRect(0, 38, DISPLAY_WIDTH, 26, black);
        // Two columns: left center x=16, right center x=48
        for (int i = 0; i < 2; i++) {
            int16_t colCenter = (i == 0) ? 16 : 48;

            // Day name (TomThumb, baseline=44, glyphs y=39-43)
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(amber);
            int16_t dayNameWidth = strlen(weatherData.forecast[i].dayName) * 4;
            dma_display->setCursor(colCenter - dayNameWidth / 2, 44);
            dma_display->print(weatherData.forecast[i].dayName);

            // Forecast icon (8x8 native, y=47-54)
            const uint16_t* builtinForecastIcon = getBuiltinWeatherIcon(weatherData.forecast[i].icon);
            if (builtinForecastIcon) {
                drawProgmemIcon(dma_display, builtinForecastIcon, colCenter - 4, 47, 1);
            } else {
                CachedIcon* forecastIcon = getIcon(weatherData.forecast[i].icon);
                if (forecastIcon && forecastIcon->valid) {
                    drawIconAtScale(forecastIcon, colCenter - 4, 47, 1);
                }
            }

            // Min temp in blue (TomThumb, baseline=62, glyphs y=57-61)
            char minStr[8];
            snprintf(minStr, sizeof(minStr), "%d", weatherData.forecast[i].tempMin);
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(coldBlue);
            int16_t minWidth = strlen(minStr) * 4;
            dma_display->setCursor(colCenter - minWidth - 2, 62);
            dma_display->print(minStr);

